anh_dulieu_cauhinh/dulieu/ab_output_v1.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.142.128 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests

Server Software:        
Server Hostname:        172.16.142.128
Server Port:            8080

Document Path:          /api/heavy
Document Length:        89 bytes

Concurrency Level:      50
Time taken for tests:   85.500 seconds
Complete requests:      1000
Failed requests:        285
   (Connect: 0, Receive: 85, Length: 142, Exceptions: 57)
Non-2xx responses:      285
Total transferred:      210500 bytes
HTML transferred:       60500 bytes
Requests per second:    11.70 [#/sec] (mean)
Time per request:       4275.000 [ms] (mean)
Time per request:       1710.000 [ms] (mean, across all concurrent requests)
Transfer rate:          2.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   1.8      4      10
Processing:   1282 3633 855.2   3847    12397
Waiting:      1197 3591 812.1   3804    12183
Total:        1282 3633 855.5   3890    12611

Percentage of the requests served within a certain time (ms)
  50%   3847
  66%   4061
  75%   4275
  80%   4488
  90%   5130
  95%   5985
  98%   7695
  99%   9405
 100%   12611 (longest request)