anh_dulieu_cauhinh/dulieu/ab_output_v2.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.142.128 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests

Server Software:        
Server Hostname:        172.16.142.128
Server Port:            8080

Document Path:          /api/heavy
Document Length:        89 bytes

Concurrency Level:      50
Time taken for tests:   72.300 seconds
Complete requests:      1000
Failed requests:        198
   (Connect: 0, Receive: 59, Length: 99, Exceptions: 39)
Non-2xx responses:      198
Total transferred:      219200 bytes
HTML transferred:       69200 bytes
Requests per second:    13.80 [#/sec] (mean)
Time per request:       3615.000 [ms] (mean)
Time per request:       1446.000 [ms] (mean, across all concurrent requests)
Transfer rate:          3.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   1.8      4      10
Processing:   1084 3072 723.2   3253    10483
Waiting:      1012 3036 686.1   3217    10302
Total:        1084 3072 723.5   3289    10664

Percentage of the requests served within a certain time (ms)
  50%   3253
  66%   3434
  75%   3615
  80%   3795
  90%   4338
  95%   5061
  98%   6507
  99%   7953
 100%   10664 (longest request)