anh_dulieu_cauhinh/dulieu/ab_output_v5.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.142.128 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests

Server Software:        
Server Hostname:        172.16.142.128
Server Port:            8080

Document Path:          /api/heavy
Document Length:        89 bytes

Concurrency Level:      50
Time taken for tests:   28.500 seconds
Complete requests:      1000
Failed requests:        32
   (Connect: 0, Receive: 9, Length: 16, Exceptions: 6)
Non-2xx responses:      32
Total transferred:      235800 bytes
HTML transferred:       85800 bytes
Requests per second:    35.10 [#/sec] (mean)
Time per request:       1425.000 [ms] (mean)
Time per request:       570.000 [ms] (mean, across all concurrent requests)
Transfer rate:          8.78 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   1.8      4      10
Processing:   427 1211 285.2   1282    4132
Waiting:      399 1197 270.1   1268    4061
Total:        427 1211 285.5   1296    4203

Percentage of the requests served within a certain time (ms)
  50%   1282
  66%   1353
  75%   1425
  80%   1496
  90%   1710
  95%   1994
  98%   2565
  99%   3135
 100%   4203 (longest request)